In [2]:
# What is Pandas????

# Pandas is a python library that is used for data cleaning , transformation the data and analysis efficiently....

## Pandas has two main data structures::

# 1. Series ( 1D )  --> like a column in excel or a list with labels...

# 2. DataFrame ( 2D )  --> like a table with rows and columns.......

## Series  (1D) --> Labeled Array

In [34]:
# A Series is like a list with labels (index).

# creating a Series...
import pandas as pd

# from a python list...
s = pd.Series([10,20,30,40,50])

s

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [9]:
# With custom index.....

import pandas as pd

marks = pd.Series([43,51,55,60,78,90], index=['Rohit', 'Mohid', 'Ali', 'Hannan', 'Talha', 'Saim'])

# print(marks)
# type(marks)
print(marks['Hannan'])

60

In [35]:
# From a Dictionary....

import pandas as pd

dic = pd.Series({'age': 20, 'city': 'Faisalabad', 'Country': 'Pakistan'})

dic

age                20
city       Faisalabad
Country      Pakistan
dtype: object

In [32]:
import pandas as pd

countries = ['Pakistan', 'Germany', 'Uganda', 'United States', 'India']
populations_millions = [10_000, 23_000, 12_000, 32_000, 50_000]

series_countries = pd.Series(data=populations_millions, index=countries, name='Population_millions')

print(series_countries)

Pakistan         10000
Germany          23000
Uganda           12000
United States    32000
India            50000
Name: Population_millions, dtype: int64

## Pandas DataFrame (2D)

In [33]:
# A 2D labeled data structure like an (Excel table)..
# Contains rows and columns...
# Built on top of Series...

import pandas as pd

# from dictionary of lists..
data = {"Name": ['Hannan', 'Mohid', 'Talha', 'Abdullah'],
       "Age": [20, 22, 18, 20],
       "Country": ['Pakistan', 'Uk', 'Germany', 'Pakistan'],
       "City": ['Faisalabad', 'London', 'Uganda', 'Lahore']}

df = pd.DataFrame(data)
df

       Name  Age   Country        City
0    Hannan   20  Pakistan  Faisalabad
1     Mohid   22        Uk      London
2     Talha   18   Germany      Uganda
3  Abdullah   20  Pakistan      Lahore

In [36]:
# from list of dictionary....
import pandas as pd

data = [
    {"Name": 'Hannan', "Age": 20, "Marks": 250, "Country": 'Pakistan'},
    {"Name": 'John', "Age": 25, "Marks": 350, "Country": 'Germany'},
    {"Name": 'Rohit', "Age": 23, "Marks": 150, "Country": 'India'}
]

df = pd.DataFrame(data)

df

     Name  Age  Marks   Country
0  Hannan   20    250  Pakistan
1    John   25    350   Germany
2   Rohit   23    150     India

In [37]:
import pandas as pd

data = pd.Series([1_000, 10_000, 20_000, 80_000, 90_000], index=['Pakistan', 'Germany', 'India', 'Romania', 'Uganda' ])

data

Pakistan     1000
Germany     10000
India       20000
Romania     80000
Uganda      90000
dtype: int64

In [38]:
data = [
    {"Name": 'Hannan', "Age": 20, "City": 'Faisalabad'},
    {"Name": 'Krish', "Age": 24, "City": 'Lahore'},
    {"Name": 'Rohit', "Age": 27, "City": 'Dehli'}
]

df = pd.DataFrame(data)
df

     Name  Age        City
0  Hannan   20  Faisalabad
1   Krish   24      Lahore
2   Rohit   27       Dehli